----------------------------------------
# Functions
2 arguements = separator and variable name

variable users {
        type = list
        default = ["azam","sajjad","rupert"]
}


output printfirst {
        value = "${join(",",var.users)}"
}

devops@T480:~/terraform/function$ terraform plan

Changes to Outputs:
  + printfirst = "azam,sajjad,rupert"

 ---------------------------------------- 
## String functions
chomp
            chomp removes newline characters at the end of a string.
endswith
format
            format produces a string by formatting a number of other values according to a specification string
formatlist
            formatlist produces a list of strings by
            formatting a number of other values
            according to a specification string
indent
            indent adds a given number of spaces to the
            beginnings of all but the first line in a given
            multi-line string
join
            join produces a string by concatenating
            together all elements of a given list of
            strings with the given delimiter
lower
            lower converts all cased letters in the
            given string to lowercase.
regex
            regex applies a regular expression to
            a string and returns the matching
            substrings
regexall
            regexall applies a regular expression to a
            string and returns a list of all matches
replace
            replace searches a given string for another given substring, and replaces each occurrence with a given replacement string
split
            split produces a list by dividing a given string
            at all occurrences of a given separator.
startswith
strcontains
strrev
            strrev reverses the characters in a string
substr
            substr extracts a substring from a
            given string by offset and length
title
            title converts the first letter of each
            word in the given string to uppercase
trim
            trim removes the specified characters
            from the start and end of the given string
trimprefix
            trimprefix removes the specified prefix
            from the start of the given string. If the
            string does not start with the prefix, the
            string is returned unchanged
trimsuffix
            trimsuffix removes the specified suffix
            from the end of the given string
trimspace
            trimspace removes all types of
            whitespace from both the start and the
            end of a string
upper
            upper converts all cased letters in the
            given string to uppercase


~~~sh
devops@T480:~/terraform/concept/function$ terraform console
> chomp("hello\n")
"hello"
> format("Hello, %s!", "Ander")
"Hello, Ander!"
> format("There are %d lights", 4)
"There are 4 lights"
> formatlist("hello, %s!", ["Valentine", "Ander", "Rupert"])
tolist([
  "hello, Valentine!",
  "hello, Ander!",
  "hello, Rupert!",
])
> formatlist("%s, %s!", "Salutations", ["Valentine", "Ander", "Rupert"])
tolist([
  "Salutations, Valentine!",
  "Salutations, Ander!",
  "Salutations, Rupert!",
])

> join("-", ["foo", "bar", "baz"])
"foo-bar-baz"

> split(",","foo,bar,baz")
tolist([
  "foo",
  "bar",
  "baz",
])
> strrev("hello")
"olleh"
> substr("hello world", 1, 4)
"ello"
> title("hello world")
"Hello World"
> trim("?!hello?!", "!?")
"hello"
> trim("?!hello?!", "!")
"?!hello?"
> trimprefix("hello world", "hello")
" world"
> trimprefix("helloworld", "hello")
"world"
> trimsuffix("helloworld", "world")
"hello"
> trimspace("  hello\n\n")
"hello"
> upper("hello")
"HELLO"
> lower("HeLLO")
"hello"
> join("m", ["foo", "bar", "baz"])
"foombarmbaz"
> join(",", ["foo", "bar", "baz"])
"foo,bar,baz"
> join(", ", ["foo", "bar", "baz"])
"foo, bar, baz"
~~~

output printfirst {
        value = "${join(",",var.users)}"
}

output printsecond {
        value = "${upper(var.users[0])}"
}


output printthird {
        value = "${lower(var.users[2])}"
}

output printfourth {
        value = "${title(var.users[1])}"   <--first character Capital>
}


devops@T480:~/terraform/function$ terraform plan

Changes to Outputs:
  + printfirst  = "Azam,saJJad,Rupert"
  + printfourth = "SaJJad"
  + printsecond = "AZAM"
  + printthird  = "rupert"

----------------------------------------------------
## Collection Functions
alltrue returns true if all elements in a given
collection are true or "true". It also returns
true if the collection is empty.

anytrue returns true if any element in a
given collection is true or "true". It also
returns false if the collection is empty——

chunklist splits a single list into fixed-size
chunks, returning a list of lists

coalesce takes any number of arguments and returns
the first one that isn't null or an empty string

coalescelist takes any number of list arguments and returns
the first one that isn't empty

compact takes a list of strings and
returns a new list with any empty
string elements removed 

concat takes two or more lists and
combines them into a single list

contains determines whether a given
list or set contains a given single
value as one of its elements

distinct takes a list and returns
a new list with any duplicate
elements removed

element retrieves a single element from a list

Index finds the element index for a given
value in a list

flatten takes a list and replaces any elements that are
lists with a flattened sequence of the list contents

keys takes a map and returns a list containing the keys from that map

length determines the length of a given list, map, or string

Lookup retrieves the value of a single
element from a map, given its key. If the
given key does not exist, the given default
value is returned instead.

Matchkeys constructs a new list by taking a subset of elements from one list whose indexes match the corresponding indexes Of values in another list

merge takes an arbitrary number of maps or
objects, and returns a single map or object that
contains a merged set of elements from all
arguments

one takes a list, set, or tuple value with either zero or
one elements. If the collection is empty, one returns
null. Otherwise, one returns the first element. If there
are two or more elements then one will return an error

range generates a list of numbers using a start
value, a limit value, and a step value

reserve takes a sequence and produces a new sequence
of the same length with all of the same elements as the
given sequence but in reverse order

setintersection function takes multiple sets and produces
a single set containing only the elements that all of the
given sets have in common. In other words, it computes
the intersection of the sets

setproduct function finds all of the possible
combinations of elements from all of the given sets by
computing the Cartesian product.

Setsubtract function returns a new set containing the
elements from the first set that are not present in the
second set. In other words, it computes the relative
complement of the first set in the second set

setunion function takes multiple sets and produces a
single set containing the elements from all of the given
sets. In other words, it computes the union of the sets

slice extracts some consecutive elements from within a list

sort takes a list of strings and returns a new list with those strings sorted lexicographically

sum takes a list or set of numbers and
returns the sum of those numbers

transpose takes a map of lists of strings
and swaps the keys and values to
produce a new map of lists of strings

values takes a map and returns a
list containing the values of the
elements in that map

zipmap constructs a map from a list of
keys and a corresponding list of values

~~~sh
> alltrue(["true", true])
true
> alltrue([true, false])
false
> anytrue(["true"])
true
> anytrue([true, false])
true
> chunklist(["a", "b", "c", "d", "e", "f"], 2)
tolist([
  tolist([
    "a",
    "b",
  ]),
  tolist([
    "c",
    "d",
  ]),
  tolist([
    "e",
    "f",
  ]),
])
> coalesce("a", "b")
"a"
> coalesce("", "b")
"b"
> coalesce(1,2)
1
> coalescelist(["a", "b"], ["c", "d"])
[
  "a",
  "b",
]
>

>

>

>

>

> compact(["a", "", "b", "c"])
tolist([
  "a",
  "b",
  "c",
])
> concat(["a", ""], ["b", "c"])
[
  "a",
  "",
  "b",
  "c",
]
> contains(["a", "b", "c"], "a")
true
> distinct(["a", "b", "a", "c", "d", "b"])
tolist([
  "a",
  "b",
  "c",
  "d",
])
> element(["a", "b", "c"], 3)
"a"
> element(["a", "b", "c"], 2)
"c"
> element(["a", "b", "c"], 1)
"b"
> element(["a", "b", "c"], 0)
"a"
> element(["a", "b", "c"])
╷
│ Error: Not enough function arguments
│
│   on <console-input> line 1:
│   (source code not available)
│
│ Function "element" expects 2 argument(s). Missing
│ value for "index".
╵


> element(["a", "b", "c"], 2)
"c"
> index(["a", "b", "c"], "b")
1
> flatten([[["a", "b"], []], ["c"]])
[
  "a",
  "b",
  "c",
]
> keys({a=1, c=2, d=3})
[
  "a",
  "c",
  "d",
]
> values({a=1, c=2, d=3})
[
  1,
  2,
  3,
]
> length([])
0
> length(["a", "b"])
2
> lookup({a="ay", b="bee"}, "a", "what?")
"ay"
> lookup({a="ay", b="bee"}, "c", "what?")
"what?"
> matchkeys(["i-123", "i-abc", "i-def"], ["us-west", "us-east", "us-central"], ["us-east"])
tolist([
  "i-abc",
])

> merge({a="b", c="d"}, {e="f", c="z"})
{
  "a" = "b"
  "c" = "z"
  "e" = "f"
}
> one([])
null
> one(["heelo"])
"heelo"
> one(["heelo", "woord"])
╷
│ Error: Invalid function argument
│
│   on <console-input> line 1:
│   (source code not available)
│
│ Invalid value for "list" parameter: must be a list,
│ set, or tuple value with either zero or one elements.
╵


> range(10)
tolist([
  0,
  1,
  2,
  3,
  4,
  5,
  6,
  7,
  8,
  9,
])
> reverse([1, 2, 3])
[
  3,
  2,
  1,
]
> setintersection(["a", "b"], ["b", "c"], ["b", "d"])
toset([
  "b",
])
> setproduct(["dev", "staging", "prod"], ["app1", "app2"])
tolist([
  [
    "dev",
    "app1",
  ],
  [
    "dev",
    "app2",
  ],
  [
    "staging",
    "app1",
  ],
  [
    "staging",
    "app2",
  ],
  [
    "prod",
    "app1",
  ],
  [
    "prod",
    "app2",
  ],
])
> setsubtrace(["a", "b", "c"], ["a", "c"])
╷
│ Error: Call to unknown function
│
│   on <console-input> line 1:
│   (source code not available)
│
│ There is no function named "setsubtrace". Did you
│ mean "setsubtract"?
╵


> setsubtract(["a", "b", "c"], ["a", "c"])
toset([
  "b",
])
> setunion(["a", "b"], ["b", "c"], ["d"])
toset([
  "a",
  "b",
  "c",
  "d",
])
> slice(["a", "b", "c", "d"], 1, 3)
[
  "b",
  "c",
]
> slice(["a", "b", "c", "d"], 1, 2)
[
  "b",
]
> slice(["a", "b", "c", "d"], 1, 1)
[]
> slice(["a", "b", "c", "d"], 0, 1)
[
  "a",
]
> slice(["a", "b", "c", "d"], 1, 1)
[]
> slice(["a", "b", "c", "d"], 1, 2)
[
  "b",
]
> slice(["a", "b", "c", "d"], 1, 3)
[
  "b",
  "c",
]
> sort(["e", "b", "a", "d", "x"])
tolist([
  "a",
  "b",
  "d",
  "e",
  "x",
])
> sum([10, 13, 14, 4.5])
41.5
> transpose({"a" = ["1", "2"], "b"=["2", "3"]})
tomap({
  "1" = tolist([
    "a",
  ])
  "2" = tolist([
    "a",
    "b",
  ])
  "3" = tolist([
    "b",
  ])
})
> zipmap(["a", "b"], [1, 2])
{
  "a" = 1
  "b" = 2
}
>
~~~
--------------------------------------
## Map Function

devops@T480:~/terraform/variableMap$ cat *
output "userage" {
value = "my name is azam & my age is ${lookup(var.usersage, "azam")}"
}


variable "usersage" {
        type = map
        default = {
                azam = 33
                rupert = 29
                sajjad = 34
                }
}

or
--------------------------------------
output "userage" {
        value = "my name is ${var.user} and my age is ${lookup(var.usersage, "${var.user}")}"
}
variable "usersage" {
        type = map
        default = {
                azam = 33
                rupert = 29
                sajjad = 34
                }
}

variable "user" {
        type = string
}


if you dont want to input variable prompts on terminal 
specify values for your variables in a .tfvars file

------------------------------------------
 devops@T480:~/terraform/variableMaptfvars$ cat terraform.tfvars
user="rupert"


output "userage" {
        value = "my name is ${var.user} and my age is ${lookup(var.usersage, "${var.user}")}"
}
variable "usersage" {
        type = map
        default = {
                azam = 33
                rupert = 29
                sajjad = 34
                }
}

variable "user" {
        type = string
}

devops@T480:~/terraform/variableMaptfvars$ terraform plan

Changes to Outputs:
  + userage = "my name is rupert and my age is 29"

----------------------------------------------
if you have multiple environment variables files,
then....

 devops@T480:~/terraform/variableMaptfvars$ cat dev.tfvars
user="sajjad"
----->
devops@T480:~/terraform/variableMaptfvars$ terraform plan

Changes to Outputs:
  + userage = "my name is rupert and my age is 29"

----->
devops@T480:~/terraform/variableMaptfvars$ terraform plan --var-fi
le=dev.tfvars

Changes to Outputs:
  + userage = "my name is sajjad and my age is 34"

  --------------------------------------------
## ENV Variable
devops@T480:~/terraform/variableEnv_TF_VAR$ cat *
output printname {
        value = "Hello, ${var.username}"
}
variable "username" {
        type = string
}


~/terraform/variableEnv_TF_VAR$ export TF_VAR_username=julia

devops@T480:~/terraform/variableEnv_TF_VAR$ terraform plan

Changes to Outputs:
  + printname = "Hello, julia"
-------------------------------------------------------
## Numeric functions
abs - returns absolute value of given number

ceil
- ceil returns the closest whole number that is greater than
or equal to the given value 

floor 
- floor returns the closest whole number that is less
than or equal to the given value, which may be a fraction

log
- Log returns the logarithm of a given number in a given base
> log(50, 10)
1.6989700043360185
max
min

parseint
- parseint parses the given string as a
representation of an integer in the specified
base and returns the resulting number

> parseint("100", 10)
100
> parseint("FF", 10)
255
> parseint("10", 16)
-16
> parseint("1011111011101111", 2)
48879
> parseint("aA", 62)
656
> parseint("12", 2)
Error: Invalid function argument

pow
- pow calculates an exponent, by
raising its first argument to the
power of the second argument.
> pow(3, 2)
9
> pow(4, 0)
1
signum

------------------------------------------------------------------------
## Encoding And Decoding Functions
Functions that will encode and decode for various formats

base64encode            base64decode
jsonencode              jsondecode
textencodebase64        textdecodebase64
Yamlencode              yamldecode
base64gzip
urlencode
•
•
•
•
csvdecode

~~~sh
> base64encode("Hello world")
"SGVsbG8gd29ybGQ="
> base64decode("SGVsbG8gd29ybGQ=")
"Hello world"
> "http://dhamaps.com/search?q=${urlencode("terraform urlencode")}"
"http://dhamaps.com/search?q=terraform%20urlencode"
~~~

------------------------------------------------------------------------
## Filesystem Functions
abspath takes a string containing a filesystem path and converts it
to an absolute path. That is, if the path is not absolute, it will be
joined with the current working directory

dirname takes a string containing a filesystem path
and removes the last portion from it.

pathexpand takes a filesystem path that might begin with
a segment, and if so it replaces that segment with the
current user's home directory path

basename takes a string containing a filesystem path
and removes all except the last portion from it

file reads the contents of a file at the
given path and returns them as a string

fileset enumerates a set of regular
file names given a path and pattern

filebase64 reads the contents of a
file at the given path and returns
them as a base64-encoded string

templatefile reads the file at the given —
path and renders its content as a template
using a supplied set of template variables

~~~sh
> file("${path.module}/variable.tf")
<<EOT
variable users {
        type = list
        default = ["Azam","saJJad","Rupert"]
}

EOT
> fileexists("${path.module}/hello.txt")
false
> fileset(path.module, "files/*.txt")
toset([])
> filebase64("${path.module}/hello.txt")
"YXpt"


%{ for addr in ip_addrs ~}
backend ${addr}:${port}
%{ endfor ~}


> templatefile("${path.module}/backends.tpl", { port = 8080, ip_addrs = ["10.1.0.0", "10.1.0.1"]})
backend 10.1.0.1:8080
backend 10.1.0.1:8080




> abspath(path.root)
"/home/devops/terraform/concept/function"
~~~

----------------------------------------------------------------------------
## Time And Date Functions

formatdate converts a timestamp
into a different time format

timeadd adds a duration to a
timestamp, returning a new timestamp


timestamp returns a UTC timestamp
string in RFC 3339 format

~~~sh
> timestamp()
"2024-01-12T11:32:01Z"
> formatdate("DD MMM YYYY hh:mm ZZZ", "2024-01-12T11:32:01Z")
"12 Jan 2024 11:32 UTC"
> formatdate("EEEE, DD MMM YYYY hh:mm ZZZ", "2024-01-12T11:32:01Z")
"Friday, 12 Jan 2024 11:32 UTC"
> formatdate("EEE, DD MMM YYYY hh:mm ZZZ", "2024-01-12T11:32:01Z")
"Fri, 12 Jan 2024 11:32 UTC"
> formatdate("hh:mmaa", "2024-01-12T11:32:01Z")
"11:32am"
> timeadd("2024-01-12T11:32:01Z", "1h")
"2024-01-12T12:32:01Z"
> timeadd("2024-01-12T11:32:01Z", "10m")
"2024-01-12T11:42:01Z"
~~~
-----------------------------------------------------------
## Hash and Crypto Functions
once encrypted, cannot be decrypted. only compared with matching encrypted string to decode whats in it

base64sha256
base64sha512
bcrypt
filebase64sha256
filebase64sha512
filemd5
fileshal
filesha256
• filesha512
md5
•
rsadecrypt
shal
sha256
sha512
uuid
•
uuidv5
•
~~~sh
> bcrypt("hello world")
"$2a$10$chKhtIb5a2GEZU6ZPiBG7e5QBKw0rg40Q43Ly3znxF9bIyCGzFm5m"
~~~
-----------------------------------------------------------
## IP Network Functions
cidrhost calculates a full host IP address
for a given host number within a given

IP network address prefix
cidrnetmask converts an IPv4 address prefix given
in CIDR notation into a subnet mask address

cidrsubnet calculates a subnet address
within given IP network address prefix

cidrsubnets calculates a sequence of consecutive
IP address ranges within a particular CIDR prefix.

~~~sh
> cidrhost("10.12.127.0/20", 16)
"10.12.112.16"
> cidrhost("10.12.127.0/20", 268)
"10.12.113.12"
> cidrnetmask("172.16.0.0/12")
"255.240.0.0"
> cidrsubnet("172.16.0.0/12", 4, 2)
"172.18.0.0/16"
> cidrsubnet("172.1.2.0/24", 4, 15)
"172.1.2.240/28"

> cidrsubnets("10.1.0.0/16", 4, 4, 8, 4)
tolist([
  "10.1.0.0/20",
  "10.1.16.0/20",
  "10.1.32.0/24",
  "10.1.48.0/20",
])
~~~
------------------------------------------------------------
## Type Conversion Functions

can evaluates the given expression and returns a boolean value indicating whether the expression produced a result without any errors

defaults a specialized function intended for use with input
variables whose type constraints are object types or
collections of object types that include optional attributes

nonsenstive takes a sensitive value and returns a
copy of that value with the sensitive marking
removed, thereby exposing the sensitive value

sensitive takes any value and returns a copy of it marked so
that Terraform will treat it as sensitive, with the same
meaning and behavior as for sensitive input variables.

> can(local.foo.bar)


> locals { 
    sensitive_content = sensitive(file("${path.module}/sensitive.txt")) 
}

> output "sensitive_example_hash" { 
    value = nonsensitive(sha256(var.sensitive_example)) 
}


tobool converts its argument to a boolean value
tomap converts its argument to a map value
toset converts its argument to a set value.
tolist converts its argument to a list value
tonumber converts its argument to a number value
tostring converts its argument to a set value
try evaluates all of its argument expressions in turn and returns the result of the first one that does not produce any errors

~~~sh
> tobool("true")
true
> tomap({"a" = 1, "b" = 2})
tomap({
  "a" = 1
  "b" = 2
})

> toset(["a", "b", "c"])
toset([
  "a",
  "b",
  "c",
])
> tolist(["a", "b", 3])
tolist([
  "a",
  "b",
  "3",
])
> tonumber("1")
1
> tostring(true)
"true"

locals {
    example = try(
        [tostring(var.example)],
        tolist(var.example),
    )
}

~~~
